Revit 2024 API
AreaLoad.Area Property
 Returns area of the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double Area { get; }
Visual Basic
Public ReadOnly Property Area As Double
	Get
Visual C++
public:
property double Area {
	double get ();
}
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace